app/Controllers/Admin/Datapenjadwalan.php

   public function index()
   {
      $model = new JadwalModel();
      $data = $model->findAll();
---
SELECT *
FROM `tbl_jadwal`