app/Controllers/Admin/Penjadwalan.php

SELECT *
FROM `tbl_jadwal`
---
    public function index()
    {
        $model = new JadwalModel();
        $data['jadwal'] = $model->findAll();