app/Controllers/Login.php

   public function auth()
   {
      $session = session();
      $model = new UserModel();
      $username = $this->request->getPost('username');
      $password = $this->request->getPost('password');
      $data = $model->where('username', $username)->first();
---
SELECT *
FROM `tbl_user`
WHERE `username` = 'pratama'
 LIMIT 1