app/Controllers/Users/Pemantauan.php

   public function index()
   {
      $model = new PemantauanModel();
      $data = $model->findAll();
---
SELECT *
FROM `tbl_pemantauan`