app/Controllers/Users/Penjadwalan.php

   public function index()
   {
      $model = new JadwalModel();
      $data['jadwal'] = $model->findAll();
---
SELECT *
FROM `tbl_jadwal`